{
    "home": {
        "title": "My name is Will and I'm a Full Stack Software Engineer at Fidelity Investments in North Carolina.",
        "description": [
            "I'm a long time resident of central North Carolina - specifically Chapel Hill. I became interested in computer science when I was in middle school by building custom computers. I thought technology and computers were incredibly important considering how much I used them daily, so I thought I'd demystify the magic myself and learn how they work.",
            "As a freshman I ended up loving my first programming course at UNC, was immediately recruited to be a TA, and went on to help teach intro courses for the next five semesters. With languages such as Java, Typescript, and Python, I've taught a wide range of topics such as Object-Oriented vs Functional Programming, ES6 and higher-order functions, the difference between reference and value types, and parsing scientific data for analysis. In addition, I assisted with research on multiple projects in the Computer Science Department for over two years as part of the Graphics and Virtual Reality Research Group.",
            "I'm currently working as a Software Engineer at Fidelity Investments on the NetBenefits Homepage team. I love any sort of programming from OOP to Functional, but enjoy web development the most",
            "When I don't have VSCode pulled up I'm either out exercising, at home watching European Football, or playing with my two-year-old dog, Sudo."
        ]
    },
    "education": {
        "unc": {
            "degree": "Bachelors of Science in Computer Science",
            "universityName": "University of North Carolina at Chapel Hill",
            "graduationYear": "August, 2020",
            "studyAboard": {
                "programName": "DIS Study Abroad in Scandenavia: Copenhagen",
                "date": "Summer 2019",
                "course": "COMP 180: Serious Games"
            },
            "certifications": [
                {
                    "title": "UNC Chapel Hill Full Stack Web Development Bootcamp",
                    "description": "Shortly after graduating with a Computer Science degree from UNC Chapel Hill, I enrolled in their Web Development Bootcamp to continue to refine and practice my skills while I searched for a job. By the end of the Bootcamp, I had accepted an offer with Fidelity Investments to join them as a Full Stack Web Developer."
                }
            ],
            "extracurriculars": [
                {
                    "title": "Undergraduate Teaching Assistant for COMP 110, COMP 101, and COMP 116",
                    "description": "For six of my eight semesters at UNC Chapel Hill, I worked as a TA in the Computer Science Department."
                },
                {
                    "title": "Undergraduate Research Assistant in UNC's Graphics and Virtual Reality research group",
                    "description": "For about half of my time at UNC, I worked as one of two undergraduates in the Telepresence Research Group."
                },
                {
                    "title": "BeAM Makerspace Member",
                    "description": "As a member of the Be A MAker (BeAM) Makerspace, I was trained on and had access to multiple makerspace workshops such as a wood shop, metal shop, 3D printers, laster cutters, etc."
                },
                {
                    "title": "Intramural Soccer Player",
                    "description": "I played intramural soccer every year I was at UNC. Sometimes, with Computer Science TA groups I was in."
                }
            ],
            "coursework": {
                "cs": [
                    "COMP 110: Introduction to Programming",
                    "COMP 180: Serious Games",
                    "COMP 290: Special Topics in Computer Science",
                    "COMP 393: Software Engineering Practicum",
                    "COMP 401: Foundations of Programming",
                    "COMP 410: Data Structures and Analysis",
                    "COMP 411: Computer Organization",
                    "COMP 426; Modern Web Programming",
                    "COMP 431: Internet Services and Protocols",
                    "COMP 433: Mobile Computing Systems",
                    "COMP 455: Models of Languages and Computation",
                    "COMP 541: Digital Logic and Computer Design",
                    "COMP 550: Algorithms and Analysis"
                ],
                "math": [
                    "MATH 233: Calculus of Functions of Several Variables",
                    "MATH 381: Discrete Mathematics",
                    "MATH 383: First Course in Differential Equations",
                    "MATH 547: Linear Algebra",
                    "STOR 435: Introduction to Probability",
                    "PHYS 118: Introductory Calculus-Based Mechanics of Relativity"
                ]
            }
        },
        "chhs": {
            "degree": "High School Diploma",
            "universityName": "Chapel Hill High School",
            "graduationYear": "June, 2016",
            "coursework": [
                
            ]

        }
     
    },
    "teaching":"",
    "research":"",
    "exterprise": "",
    "work":"",
    "feedback": {
        "fidelity": [
            {
                "name": "Cristina Wong",
                "role": "QA Engineer",
                "time": "Two years",
                "feedback": "Will has been wonderful to work with in the two years that we have worked together at Fidelity Investments. He is a gifted engineer who has particularly stood out by the positive energy he has brought to the team. I have admired his strong communication skills and engagement with our professional community. Moreover, the team could always rely on him when we were in a pinch! He would be an excellent asset to any software team."
            },
            {
                "name": "Mounika Chigurupati",
                "role": "QA Engineer",
                "time": "18 months",
                "feedback": "In the 18 months I've collaborated with Will, I've come to recognize his exceptional professionalism. His guidance was instrumental in understanding the functionalities of graphQL APIs for me and his patience in educating others is commendable. Will's work ethic and communication abilities are truly impressive. He demonstrates remarkable adaptability to various situations and business environments. His active role in organizing team-building activities has greatly enhanced our team's rapport. However, it's his readiness to assist others that truly distinguishes him. Working alongside Will has been a gratifying experience."
            },
            {
                "name": "Arijit Paul",
                "role": "Senior Software Engineer",
                "time": "18 months",
                "feedback": "Will is a highly skilled & detail-oriented software developer. I had the pleasure of working with Will at Fidelity Investments for about a year and a half. I was impressed by his technical expertise and his ability to deal with difficult problems effortlessly. He handles multiple projects with competing priorities extremely effectively. Super nice guy and always willing to help a team member. I highly recommend Will as a software engineer and true team-player."
            }
        ],
        "unc": [],
        "other": [],
        "endorsements": [
            "Git",
            "Javascript",
            "Java",
            "Jenkins",
            "Data Structures",
            "AngularJS",
            "uDeploy (IMB Urban Code Deploy)",
            "Spring Boot",
            "Jira",
            "Splunk",
            "Datadog",
            "Insomnia",
            "Programming",
            "Customer Service"
        ]
    }
}