{
    "home": {
        "title": "My name is Will and I'm a Full Stack Software Engineer at Fidelity Investments in North Carolina.",
        "description": [
            "I'm a long time resident of central North Carolina - specifically Chapel Hill. I became interested in computer science when I was in middle school by building custom computers. I thought technology and computers were incredibly important considering how much I used them daily, so I thought I'd demystify the magic myself and learn how they work.",
            "As a freshman I ended up loving my first programming course at UNC, was immediately recruited to be a TA, and went on to help teach intro courses for the next five semesters. With languages such as Java, Typescript, and Python, I've taught a wide range of topics such as Object-Oriented vs Functional Programming, ES6 and higher-order functions, the difference between reference and value types, and parsing scientific data for analysis. In addition, I assisted with research on multiple projects in the Computer Science Department for over two years as part of the Graphics and Virtual Reality Research Group.",
            "I'm currently working as a Software Engineer at Fidelity Investments on the NetBenefits Homepage team. I love any sort of programming from OOP to Functional, but enjoy web development the most",
            "When I don't have VSCode pulled up I'm either out exercising, at home watching European Football, or playing with my two-year-old dog, Sudo."
        ]
    },
    "education": {
        "unc": {
            "degree": "Bachelors of Science in Computer Science",
            "universityName": "University of North Carolina at Chapel Hill",
            "graduationYear": "August, 2020",
            "photoPath": "/assets/images/education/UNC.png",
            "studyAboard": {
                "programName": "DIS Study Abroad in Scandenavia: Copenhagen",
                "date": "Summer 2019",
                "course": "COMP 180: Serious Games"
            },
            "certifications": [
                {
                    "title": "UNC Chapel Hill Full Stack Web Development Bootcamp",
                    "description": "Shortly after graduating with a Computer Science degree from UNC Chapel Hill, I enrolled in their Web Development Bootcamp to continue to refine and practice my skills while I searched for a job. By the end of the Bootcamp, I had accepted an offer with Fidelity Investments to join them as a Full Stack Web Developer."
                }
            ],
            "extracurriculars": [
                {
                    "title": "Undergraduate Teaching Assistant for COMP 110, COMP 101, and COMP 116",
                    "description": "For six of my eight semesters at UNC Chapel Hill, I worked as a TA in the Computer Science Department."
                },
                {
                    "title": "Undergraduate Research Assistant in UNC's Graphics and Virtual Reality research group",
                    "description": "For about half of my time at UNC, I worked as one of two undergraduates in the Telepresence Research Group."
                },
                {
                    "title": "BeAM Makerspace Member",
                    "description": "As a member of the Be A MAker (BeAM) Makerspace, I was trained on and had access to multiple makerspace workshops such as a wood shop, metal shop, 3D printers, laster cutters, etc."
                },
                {
                    "title": "Intramural Soccer Player",
                    "description": "I played intramural soccer every year I was at UNC. Sometimes, with Computer Science TA groups I was in."
                }
            ],
            "coursework": {
                "cs": [
                    "COMP 110: Introduction to Programming",
                    "COMP 180: Serious Games",
                    "COMP 290: Special Topics in Computer Science",
                    "COMP 393: Software Engineering Practicum",
                    "COMP 401: Foundations of Programming",
                    "COMP 410: Data Structures and Analysis",
                    "COMP 411: Computer Organization",
                    "COMP 426; Modern Web Programming",
                    "COMP 431: Internet Services and Protocols",
                    "COMP 433: Mobile Computing Systems",
                    "COMP 455: Models of Languages and Computation",
                    "COMP 541: Digital Logic and Computer Design",
                    "COMP 550: Algorithms and Analysis"
                ],
                "math": [
                    "MATH 233: Calculus of Functions of Several Variables",
                    "MATH 381: Discrete Mathematics",
                    "MATH 383: First Course in Differential Equations",
                    "MATH 547: Linear Algebra",
                    "STOR 435: Introduction to Probability",
                    "PHYS 118: Introductory Calculus-Based Mechanics of Relativity"
                ]
            }
        },
        "chhs": {
            "degree": "High School Diploma",
            "universityName": "Chapel Hill High School",
            "graduationYear": "June, 2016",
            "photoPath": "/assets/images/education/CHHS.png",
            "coursework": [
                
            ]

        }
    
    },
    "teaching":{
        "photos": {
            "fredBrooks": {
                "title": "Dr Fred Brooks and the COMP 110 Team",
                "caption": "Turing Award winner Dr. Fred Brooks and the COMP 110 TA Team. I'm on the left in UNC blue.",
                "path": "./assets/images/teaching/FredBrooks.jpg"
            },
            "openHouse": {
                "title": "Me explaining how Stereolithographic 3D printers work",
                "caption": "Explaining how Stereolithographic 3D printers are used for research in the department during UNC Computer Science's 2019 Open House",
                "path": "./assets/images/teaching/OpenHouse.jpg"
            }
        },
        "title": "During my undergraduate studies at UNC-Chapel Hill, I worked in the Computer Science Department as an Undergraduate Teaching Assistant for three different classes across six semesters, including one summer semester.",
        "classes": [
            {
                "title": "COMP 110: Intro to Programming",
                "time": "January 2017 - August 2019",
                "description": [
                    "My first teaching experience came when I was a second-semester freshman. After completing my first programming class in the fall, COMP 110, I was one of a few selected from over 120 applicants by my professor Kris Jordan to join the TAing team for the 700-student course in the spring.",
                    "First teaching in Java and later in TypeScript after the course changed languages, my main responsibilities were to tutor students one-on-one to help them complete assignments or review concepts and to help in the huge lectures when students had questions about in-class activities. Throughout my time with COMP 110, I individually tutored over 250 different students on over 350 separate occasions. I also mentored at semesterly hackathons, graded tests and quizzes, and answered student emails."
                ]
            },
            {
                "title": "COMP 101: Intro to Computing",
                "time": "August 2018 - August 2019",
                "description": [
                    "Eventually, our department decided to hand over control of COMP 101 to Kris and the TAing team for COMP 110, starting the \"COMP 1101\" team.",
                    "COMP 101 was very similar to COMP 110, teaching programming essentials in TypeScript, but was less rigorous and contained less content than its sister course. My responsibilities for the 300-student course were the same as they were for COMP 110; primarily tutoring during my \"office hours\" and assisting students in class, but also grading, answering student emails, and working at hackathons."
                ]
            },
            {
                "title": "COMP 110: Intro to Programming",
                "time": "May 2020 - July 2020",
                "description": [
                    "I concluded my time at UNC-Chapel Hill as a Teaching Assistant for a third class, COMP 116, during the first summer session (or \"Maymester\") of 2020.",
                    "I was hired in the spring by Professor Marc Neithammer, whom I knew of through my research experience in the department, to work alongside the instructor, graduate student Tom Christy, and three other TAs. This course was taught in Python and focused less on foundational programming fundamentals and more on applied uses for programming to help analyze scientific data, usually in the form of CSVs. I was responsible for one-fifth of the class - split between the four TAs and Tom - to grade assignments, tests, and answer student emails. I also held one-on-one tutoring sessions for a few hours each week and wrote problems to help students practice their skills."
                ]
            }
        ],
        "feedback": {
            "title": "Some anonymous feedback I've received from some of the hundreds of students I've helped in my one-on-one tutoring:",
            "feedback": [
                "... it's always great working with Will.",
                "Made me realize I had the right idea when I started and guided me to fix the mistake. 7/7 TA.",
                "Will is a dope undergrad TA. I came in with a significant amount of code written ... and he helped point me in the right direction by ...",
                "Explains well, really helps me understand the concepts.",
                "Great dude knows his stuff definitely deserves [an] award."
            ]
        }
    },
    "research": {
        "link": "https://telepresence.web.unc.edu/people/",
        "title": "UNC Chapel Hill Telepresence (Graphics and Virtual Reality) Research Group",
        "time": "April 2018 - August 2020",
        "photos": {
            "groupPhoto": {
                "title": "UNC Graphics and Virtual Reality Research Group",
                "caption": "UNC-Chapel Hill's Telepresence (Graphics and VR) Research Group - 2019. I'm on the far right.",
                "path": "./assets/images/research/Telepresence.jpg"
            },
            "aliens": {
                "title": "Deformable Membrane Display Aliens",
                "caption": "Three aliens at adjustable focal depths seen through the near-eye deformable membrane display.",
                "path": "./assets/images/research/Aliens.jpeg"
            },
            "deformableSetup": {
                "title": "Deformable Membrane Display Setup",
                "caption": "Headstand display, controlled by a system of hoses, valves, speakers, motors, pressure sensors, and an Arduino.",
                "path": "./assets/images/research/Setup.jpeg"
            },
            "luminanceSetup": {
                "title": "Contrast Tests I performed",
                "caption": "Contrast test I ran to determine the effect of multiple beamsplitters on the luminance of an image.",
                "path": "./assets/images/research/ContrastTest.jpeg"
            },
            "beamsplitterSetup": {
                "title": "Beamsplitter Contrast Tests",
                "caption": "Contrast test setup. All permutations were tested and recorded.",
                "path": "./assets/images/research/ContrastSetup.jpeg"
            },
            "eyeTrackingSetup": {
                "title": "Egocentric headset and eyeglasses prototype",
                "caption": "Early 2018 prototype I built for checking eye and mouth-tracking camera angles.",
                "path": "./assets/images/research/Headset.jpg"
            },
            "eyeTrackingCAD": {
                "title": "Altering camera angles",
                "caption": "Trying different locations for eye and mouth-tracking camera angles.",
                "path": "./assets/images/research/CameraPositions.png"
            }
        },
        "studies": {
            "dynamicFocus": {
                "title": "Dynamic Focus Augmented Reality Display",
                "link": "https://telepresence.web.unc.edu/research/dynamic-focus-augmented-reality-display/"
            },
            "dynamicScenes": {
                "title": "3D Reconstruction of Dynamic Scenes",
                "link": "https://telepresence.web.unc.edu/research/3dreconstructiondynamic/"
            }
        },
        "descriptions": {
            "general": [
                "In addition to teaching the joys of coding to new programmers at UNC-Chapel Hill, as an undergraduate I assisted with research for over two years in the Computer Science Department under Distinguished Professor Dr Henry Fuchs as part of the Graphics and Virtual Reality Research Group.",
                "My responsibilities differed depending on the ad-hoc teams with which I worked. My main duty was to assist a handful of graduate students and research scientists in the group with various studies and tests. I would attend weekly meetings with each group to go over any progress."
            ],
            "dynamicFocusDisplay": [
                "The project I assisted with in the group first was the Dynamic Focus Augmented Reality Display project. I worked closely with PhD then-candidate (and now recipient) and leader of the project, David Dunn, as we attempted to create a near-eye augmented reality display with dynamic focus using see-through deformable membranes. The membranes would deform with pressue from pumps to adjust for the user's near or far focal point. My largest responsibilty for the project was to create the sensitive deformable membranes in the cleanroom of <a href='https://chanl.unc.edu/' target='_blank' rel='noreferrer'>Chapel Hill's Analytical and Nanofabrication Laboratory</a> using processes such as degassing, spin-coating, sputter deposition, etc. We then used these membranes by placing them in housings and also sent them to our project collaborators at the <a href='https://www.mpi-inf.mpg.de/home' target='_blank' rel='noreferrer'>Max Planck Institut Informatik</a> for them to use.",
                "For the same project, I ran contrast tests to determine how the presence of one or more beamsplitters would impact the luminance of an image as there were concerns they would detract from the image's brightness. To test this I arranged two different sized beamsplitters, a HoloPro with a projector, and a back display behind one another in all possible permutations, taking photos each time to see how each layer contributed independently."
            ],
            "dynamicScenes": [
                "In addition to working towards our dynamic focus augmented reality display, I also regularly assisted our 3D Dynamic Scene Reconstruction team. Our goal was to be able to reconstruct a dynamic scene in a closed 3D environment using a relatively non-instrusive, inward-out looking egocentric headset. We attempted to, in real-time, virtually recreate both the user wearing the small form-factor headset as well as the closed environment that they were in accurately by using a series of many small, synchronous cameras attached to a pair of eyeglass frames. We had produced good reconstruction results previously, but with a large and bulky headset that wasn't practical for use outside of testing.",
                "My primary responsibility was to design and produce the eyeglass frames being used for the headset and work with graduate student Conny Lu to ensure the angles at which the miniture cameras were placed would produce good results from her eye, mouth, and body tracking software. The slightest of changes to the angle on any axis could produce much better or much worse results. Using such near-body cameras, occlusion was the primary issue."
            ]
        }

    },
    "enterprise": {
        "photos": {
            "oldTeamHomer": {
                "title": "Fidelity NetBenefits Homepage Team out to happy hour in 2023",
                "caption": "Local North Carolina members of the Fidelity NetBenefits Homepage Team",
                "path": "./assets/images/work/OldTeamHomer.jpeg"
            }
        },
        "descriptions": {
            "current":"I currently work as a Full-Stack Software Engineer at Fidelity Investments LLC in the Research Triangle Park of North Carolina.",
            "L3": {
                "title": "(L3) Associate Full-Stack Software Engineer",
                "dates":"January 2022 - June 2023",
                "description": "I began my career as a Software Engineer in January 2022 at Fidelity Investments as part of their new-graduate technical training program, LEAP. After learning about the Fidelity enterprise work environment and technology stack, I was placed onto the NetBenefits Homepage team within the Workplace Investing business unit, where I worked as an (L3) Associate Full-Stack Software Engineer for a bit over a year."
            },
            "L4": {
                "title": "(L4) Full-Stack Software Engineer",
                "dates": "June 2023 - Present",
                "description": "As a Full-Stack Software Engineer on the NetBenefits Homepage team, I do a bit of everything to support the business and technical requirements of the organization. I work on a team with about 10 other developers, QA engineers, systems analyists, and other contributors to implement solutions to various division and company-wide initiatives. I work across out technology stack, from creating new micro frontend components with Angular and Lit-Element to new backend services with SpringBoot and Maven, as well as update legacy systems to remain in compliance, deploy apps with Jenkins and IBM uDeploy, and monitor dashboards and logs using tools like Splunk and Datadog."
            }
        }
    },
    "feedback": {
        "fidelity": [
            {
                "name": "Cristina Wong",
                "role": "QA Engineer",
                "time": "Two years",
                "feedback": "Will has been wonderful to work with in the two years that we have worked together at Fidelity Investments. He is a gifted engineer who has particularly stood out by the positive energy he has brought to the team. I have admired his strong communication skills and engagement with our professional community. Moreover, the team could always rely on him when we were in a pinch! He would be an excellent asset to any software team."
            },
            {
                "name": "Mounika Chigurupati",
                "role": "QA Engineer",
                "time": "18 months",
                "feedback": "In the 18 months I've collaborated with Will, I've come to recognize his exceptional professionalism. His guidance was instrumental in understanding the functionalities of graphQL APIs for me and his patience in educating others is commendable. Will's work ethic and communication abilities are truly impressive. He demonstrates remarkable adaptability to various situations and business environments. His active role in organizing team-building activities has greatly enhanced our team's rapport. However, it's his readiness to assist others that truly distinguishes him. Working alongside Will has been a gratifying experience."
            },
            {
                "name": "Arijit Paul",
                "role": "Senior Software Engineer",
                "time": "18 months",
                "feedback": "Will is a highly skilled & detail-oriented software developer. I had the pleasure of working with Will at Fidelity Investments for about a year and a half. I was impressed by his technical expertise and his ability to deal with difficult problems effortlessly. He handles multiple projects with competing priorities extremely effectively. Super nice guy and always willing to help a team member. I highly recommend Will as a software engineer and true team-player."
            }
        ],
        "unc": [],
        "other": [],
        "endorsements": [
            "Git",
            "Javascript",
            "Java",
            "Jenkins",
            "Data Structures",
            "AngularJS",
            "uDeploy (IMB Urban Code Deploy)",
            "Spring Boot",
            "Jira",
            "Splunk",
            "Datadog",
            "Insomnia",
            "Programming",
            "Customer Service"
        ]
    }
}